Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "checkov -f tf.json --external-checks-git https://github.com/amazondevops/customs_policies.git --check \"JG_AWS_*_*\" --compact --quiet" in "/home/atlantis/.atlantis/repos/amazondevops/checkov/6/default": exit status 1: running "checkov -f tf.json --external-checks-git https://github.com/amazondevops/customs_policies.git --check \"JG_AWS_*_*\" --compact --quiet" in "/home/atlantis/.atlantis/repos/amazondevops/checkov/6/default": 
Found port 80 open to 0.0.0.0/0 in ingress rules for resource module.vote_service_sg[0].aws_security_group_rule.ingress_with_cidr_blocks[0]
Found port 80 open to 0.0.0.0/0 in ingress rules for resource module.vote_service_sg[1].aws_security_group_rule.ingress_with_cidr_blocks[0]
terraform_plan scan results:

Passed checks: 8, Failed checks: 2, Skipped checks: 0

Check: JG_AWS_SG_O1: "Ensure AWS security groups do not have port 80 open to everywhere"
	FAILED for resource: module.vote_service_sg[0].aws_security_group_rule.ingress_with_cidr_blocks[0]
	File: /tf.json:0-0
	Guide: Port 80 should not be open to everywhere in security group rules.
Check: JG_AWS_SG_O1: "Ensure AWS security groups do not have port 80 open to everywhere"
	FAILED for resource: module.vote_service_sg[1].aws_security_group_rule.ingress_with_cidr_blocks[0]
	File: /tf.json:0-0
	Guide: Port 80 should not be open to everywhere in security group rules.


>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Checkov Code analysis Running for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov/6/default



>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Checkov Code analysis Done for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov/6/default

>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Running plan for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov/6/default

module.ec2_instance["one"].data.aws_ssm_parameter.this[0]: Reading...
module.ec2_instance["two"].data.aws_partition.current: Reading...
module.ec2_instance["one"].data.aws_partition.current: Reading...
module.ec2_instance["two"].data.aws_ssm_parameter.this[0]: Reading...
module.ec2_instance["one"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ec2_instance["two"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ec2_instance["two"].data.aws_ssm_parameter.this[0]: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
module.ec2_instance["one"].data.aws_ssm_parameter.this[0]: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instance["one"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-01ee8bd080cb3a41b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "user1"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-eddcdzz4"
      + tags                                 = {
          + "Environment"       = "dev"
          + "Name"              = "instance-one"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all                             = {
          + "Environment"       = "dev"
          + "Name"              = "instance-one"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "instance-one"
        }
      + vpc_security_group_ids               = [
          + "sg-12345678",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.ec2_instance["two"].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-01ee8bd080cb3a41b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "user1"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-eddcdzz4"
      + tags                                 = {
          + "Environment"       = "dev"
          + "Name"              = "instance-two"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all                             = {
          + "Environment"       = "dev"
          + "Name"              = "instance-two"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "instance-two"
        }
      + vpc_security_group_ids               = [
          + "sg-12345678",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.vote_service_sg[0].aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for user-service with custom ports open within VPC, and PostgreSQL publicly open"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "user-service-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"       = "dev"
          + "Name"              = "user-service"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all               = {
          + "Environment"       = "dev"
          + "Name"              = "user-service"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + vpc_id                 = "vpc-12345678"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.vote_service_sg[0].aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.10.0.0/16",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vote_service_sg[0].aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "User-service ports"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.vote_service_sg[0].aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress Rule"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.vote_service_sg[1].aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for user-service with custom ports open within VPC, and PostgreSQL publicly open"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "user-service-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"       = "dev"
          + "Name"              = "user-service"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + tags_all               = {
          + "Environment"       = "dev"
          + "Name"              = "user-service"
          + "Terraform"         = "true"
          + "product_v2"        = "dev"
          + "terraform_managed" = "true"
        }
      + vpc_id                 = "vpc-12345678"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.vote_service_sg[1].aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.10.0.0/16",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vote_service_sg[1].aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "User-service ports"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.vote_service_sg[1].aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress Rule"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/amazondevops/checkov/6/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/amazondevops/checkov/6/default/default.tfplan"

>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Runned plan for project  at dir /home/atlantis/.atlantis/repos/amazondevops/checkov/6/default

>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Checkov analysis is running for tf.plan for the project  in the directory /home/atlantis/.atlantis/repos/amazondevops/checkov/6/default

```
</details>